---
type: FabricationPartType
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# FabricationPartType

`Autodesk.Revit.DB.FabricationPartType` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2016 | `public static FabricationPartType Create ( Document document , FabricationServiceButton button , int condition )` |
| Method | Lookup | 2016 | `public static ElementId Lookup ( Document document , FabricationServiceButton button , int condition )` |
| Property | Parameter | — | `` |